asif8270/stm32/11_adc_continuous_conversion/Inc/lis3dsh.h
/*
 * lis302dl.h
 *
 *  Created on: Oct 4, 2024
 *      Author: Asif
 */

#ifndef LIS3DSH_H
#define LIS3DSH_H

#include "stm32f4xx.h"
#include "spi.h"

// LIS3DSH Register Addresses
#define LIS3DSH_OUT_T 		0x0C
#define LIS3DSH_INFO1 		0x0D
#define LIS3DSH_INFO2 		0x0E
#define LIS3DSH_WHO_AM_I 	0x0F
#define LIS3DSH_OFF_X 		0x10
#define LIS3DSH_OFF_Y 		0x11
#define LIS3DSH_OFF_Z 		0x12
#define LIS3DSH_CS_X 		0x13
#define LIS3DSH_CS_Y 		0x14
#define LIS3DSH_CS_Z 		0x15
#define LIS3DSH_CTRL_REG1	0x21
#define LIS3DSH_CTRL_REG2   0x22
#define LIS3DSH_CTRL_REG3   0x23
#define LIS3DSH_CTRL_REG4 	0x20
#define LIS3DSH_CTRL_REG5 	0x24
#define LIS3DSH_CTRL_REG6 	0x25
#define LIS3DSH_STATUS 		0x27
#define LIS3DSH_OUT_X_L 	0x28
#define LIS3DSH_OUT_X_H 	0x29
#define LIS3DSH_OUT_Y_L 	0x2A
#define LIS3DSH_OUT_Y_H 	0x2B
#define LIS3DSH_OUT_Z_L 	0x2C
#define LIS3DSH_OUT_Z_H 	0x2D

// LIS3DSH Read Flag
#define LIS3DSH_Read_Flag	0x80

// Control Register 4 (CTRL_REG4) Configuration
#define LIS3DSH_ODR_POWER_DOWN	0x00
#define LIS3DSH_ODR_100HZ		0x67


// Function Prototypes
void lis3dshInit(void);
void lis3dshWrite(uint8_t regAddress, uint8_t value);
void lis3dshRead(uint8_t regAddress, uint8_t *rxdata, uint8_t size);

#endif // LIS3DSH_H
